# NULL

In [20]:
import mysql.connector as conn
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [21]:
myconn = conn.connect(host = 'localhost', user = 'root', passwd = '12345')

In [22]:
cursor = myconn.cursor()

In [23]:
cursor.execute('USE sakila')

In [24]:
query = """
SELECT *
FROM customer
WHERE first_name IS NULL
"""

data = pd.read_sql_query(query, myconn)

print(f"shape: {data.shape}")
data.head(2)

shape: (0, 9)

Empty DataFrame
Columns: [customer_id, store_id, first_name, last_name, email, address_id, active, create_date, last_update]
Index: []

In [25]:
data.to_csv('customer.csv', index = False)

# NOT NULL

In [26]:
query = """
SELECT *
FROM customer
WHERE first_name IS NOT NULL
"""
data = pd.read_sql(query, myconn)

print(f"shape: {data.shape}")
data.head(2)

shape: (599, 9)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,AMOGH,PATHAK,amogh9792@gmail.com,5,1,2006-02-14 22:04:36,2023-12-16 19:29:31
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

## UPDATE Values

In [27]:
query = """
UPDATE customer 
SET first_name = 'AMOGH', last_name = 'PATHAK', email = 'amogh9792@gmail.com'
WHERE  customer_id = 1
"""

cursor.execute(query)

In [28]:
query = """
SELECT *
FROM customer
WHERE customer_id = 1
"""

data = pd.read_sql(query, myconn)
data.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,AMOGH,PATHAK,amogh9792@gmail.com,5,1,2006-02-14 22:04:36,2023-12-16 19:29:31

## CREATE TABLE

In [36]:
query = """
CREATE TABLE student_datawave(attendance_number INT, 
first_name VARCHAR(50),
last_name VARCHAR(50),
percentage DECIMAL(5, 2),
std INT,
division VARCHAR(20)
)
"""
cursor.execute(query)

ProgrammingError: 1050 (42S01): Table 'student_datawave' already exists

In [30]:
cursor.execute('show tables')
cursor.fetchall()

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',),
 ('student_datawave',)]

In [45]:
query = """
SELECT * FROM student_datawave
"""

data = pd.read_sql(query, myconn)
data

   attendance_number first_name last_name  percentage  std division
0                  1      Amogh    Pathak        98.5   12        A
1                  1      Amogh    Pathak        98.5   12        A
2                  1      Amogh    Pathak        98.5   12        A
3                  1      Amogh    Pathak        98.5   12        A
4                  1      Amogh    Pathak        98.5   12        A
5                  1      Amogh    Pathak        98.5   12        A
6                  1      Amogh    Pathak        98.5   12        A
7                  2       Amol     patil        92.0   13        B

## INSERT RECORDS

In [40]:
query = """
INSERT INTO student_datawave(attendance_number, first_name, last_name, percentage, std, division)
VALUES(1, 'Amogh', 'Pathak',98.5, 12, 'A')
"""

cursor.execute(query)

In [44]:
query = """
INSERT INTO student_datawave(attendance_number, first_name, last_name, percentage, std, division)
VALUES(1, 'Amogh', 'Pathak',98.5, 12, 'A'),
      (2, 'Amol', 'patil', 92, 13, 'B')
"""

cursor.execute(query)

## DELETE

In [46]:
query = """
DELETE FROM student_datawave
WHERE last_name = 'SHARMA'
"""

cursor.execute(query)

## DROP TABLE

In [48]:
cursor.execute('USE sakila')

table_to_drop = ['test2', 'test3']

for table_name in table_to_drop:
    query = f"""
    DROP TABLE IF EXISTS {table_name}
"""

## LIMIT

In [51]:
cursor.execute('USE sakila')

query = """
SELECT *
FROM student_datawave
LIMIT 3
"""

data = pd.read_sql_query(query, myconn)

print(f"shape : {data.shape}")

data

shape : (3, 6)

   attendance_number first_name last_name  percentage  std division
0                  1      Amogh    Pathak        98.5   12        A
1                  1      Amogh    Pathak        98.5   12        A
2                  1      Amogh    Pathak        98.5   12        A

AGGREGATION

min
max
avg
count
sum

In [54]:
cursor.execute('USE world')

query = """
SELECT MAX(Population) 
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   MAX(Population)
0         10500000

### COUNT

In [55]:
cursor.execute('USE world')

query = """
SELECT count(*)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   count(*)
0      4079

In [56]:
cursor.execute('USE world')

query = """
SELECT count(*)
FROM city
WHERE Population < 1000000
"""

data = pd.read_sql_query(query, myconn)
data

   count(*)
0      3841

## AVERAGE

In [58]:
cursor.execute('USE world')

query = """
SELECT AVG(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   AVG(Population)
0      350468.2236

## SUM

In [59]:
cursor.execute('USE world')

query = """
SELECT SUM(Population)
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   SUM(Population)
0     1.429560e+09

## LIKE OPERATOR 
% : zero or one or multiple characters
    
_ : single

In [60]:
query = """
SELECT * 
FROM city 
WHERE Name LIKE 'M%'
"""

data = pd.read_sql_query(query, myconn)
print(f"shape : {data.shape}")
data.head(10)

shape : (301, 5)

    ID                 Name CountryCode      District  Population
0    4       Mazar-e-Sharif         AFG         Balkh      127800
1   22           Maastricht         NLD       Limburg      122087
2   46           Mostaganem         DZA    Mostaganem      115212
3   77        Mar del Plata         ARG  Buenos Aires      512880
4   80                Merlo         ARG  Buenos Aires      463846
5   83               Moreno         ARG  Buenos Aires      356993
6   87                Morón         ARG  Buenos Aires      349246
7   91  Malvinas Argentinas         ARG  Buenos Aires      290335
8  116              Mendoza         ARG       Mendoza      123027
9  131            Melbourne         AUS      Victoria     2865329

In [61]:
query = """
SELECT * 
FROM city 
WHERE Name LIKE '_M%'
"""

data = pd.read_sql_query(query, myconn)
print(f"shape : {data.shape}")

data.head(10)

shape : (36, 5)

    ID        Name CountryCode          District  Population
0    5   Amsterdam         NLD     Noord-Holland      731200
1   21  Amersfoort         NLD           Utrecht      126270
2   27       Emmen         NLD           Drenthe      105853
3  299  Imperatriz         BRA          Maranhão      224564
4  301        Embu         BRA         São Paulo      222223
5  326   Americana         BRA         São Paulo      177409
6  599      Ambato         ECU        Tungurahua      169612
7  726      Umlazi         ZAF     KwaZulu-Natal      339233
8  809        Imus         PHL  Southern Tagalog      195482
9  971       Ambon         IDN           Molukit      249312

## IN OPERATOR

In [62]:
query = """
SELECT * 
FROM city
WHERE Name IN('Delhi', 'Pune', 'Mumbai')
"""

data = pd.read_sql_query(query, myconn)
data

     ID   Name CountryCode     District  Population
0  1025  Delhi         IND        Delhi     7206704
1  1034   Pune         IND  Maharashtra     1566651

# Aliase AS

In [63]:
cursor.execute('USE world')

query = """
SELECT SUM(Population) AS population_sum
FROM city
"""

data = pd.read_sql_query(query, myconn)
data

   population_sum
0    1.429560e+09

In [65]:
cursor.execute('USE world')

query = """
SELECT
SUM(Population) As population_sum,
MIN(Population) As population_min,
MAX(Population) As population_max,
COUNT(Population) As population_count,
AVG(Population) As population_avg

FROM city
""" 

data = pd.read_sql_query(query, myconn)
data

,population_sum,population_min,population_max,population_count,population_avg
0,1.429560e+09,42,10500000,4079,350468.2236